repository/resources/perf-test/results/wso2_results_round2.txt
Warm-up ...
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.032042 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,064.51 [#/sec] (mean)
Time per request:		11.032 [ms] (mean)
Time per request:		0.110 [ms] (mean, across all concurrent requests)
Transfer rate:			17,693.91 [Kbytes/sec] received
				17,693.91 kb/s sent
				35,387.83 kb/s total
Warmup Completed!
Warm-up ...
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.060599 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		9,041.10 [#/sec] (mean)
Time per request:		11.061 [ms] (mean)
Time per request:		0.111 [ms] (mean, across all concurrent requests)
Transfer rate:			17,648.23 [Kbytes/sec] received
				17,648.23 kb/s sent
				35,296.46 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.147551 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,970.58 [#/sec] (mean)
Time per request:		11.148 [ms] (mean)
Time per request:		0.111 [ms] (mean, across all concurrent requests)
Transfer rate:			17,510.57 [Kbytes/sec] received
				17,510.57 kb/s sent
				35,021.14 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.345105 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,814.37 [#/sec] (mean)
Time per request:		11.345 [ms] (mean)
Time per request:		0.113 [ms] (mean, across all concurrent requests)
Transfer rate:			17,205.66 [Kbytes/sec] received
				17,205.66 kb/s sent
				34,411.32 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		11.658104 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,577.72 [#/sec] (mean)
Time per request:		11.658 [ms] (mean)
Time per request:		0.117 [ms] (mean, across all concurrent requests)
Transfer rate:			16,743.72 [Kbytes/sec] received
				16,743.72 kb/s sent
				33,487.43 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.105175 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,260.93 [#/sec] (mean)
Time per request:		12.105 [ms] (mean)
Time per request:		0.121 [ms] (mean, across all concurrent requests)
Transfer rate:			16,125.34 [Kbytes/sec] received
				16,125.34 kb/s sent
				32,250.67 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.401857 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		8,063.31 [#/sec] (mean)
Time per request:		12.402 [ms] (mean)
Time per request:		0.124 [ms] (mean, across all concurrent requests)
Transfer rate:			15,739.58 [Kbytes/sec] received
				15,739.58 kb/s sent
				31,479.16 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.544523 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,971.61 [#/sec] (mean)
Time per request:		12.545 [ms] (mean)
Time per request:		0.125 [ms] (mean, across all concurrent requests)
Transfer rate:			15,560.58 [Kbytes/sec] received
				15,560.58 kb/s sent
				31,121.15 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.679690 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,886.63 [#/sec] (mean)
Time per request:		12.680 [ms] (mean)
Time per request:		0.127 [ms] (mean, across all concurrent requests)
Transfer rate:			15,394.70 [Kbytes/sec] received
				15,394.70 kb/s sent
				30,789.40 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		12.852787 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,780.41 [#/sec] (mean)
Time per request:		12.853 [ms] (mean)
Time per request:		0.129 [ms] (mean, across all concurrent requests)
Transfer rate:			15,187.37 [Kbytes/sec] received
				15,187.37 kb/s sent
				30,374.74 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/PFProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.037352 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,670.27 [#/sec] (mean)
Time per request:		13.037 [ms] (mean)
Time per request:		0.130 [ms] (mean, across all concurrent requests)
Transfer rate:			14,972.37 [Kbytes/sec] received
				14,972.37 kb/s sent
				29,944.73 kb/s total
Warmup Completed!
===== CBR Proxy =====
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.151345 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,603.78 [#/sec] (mean)
Time per request:		13.151 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,842.59 [Kbytes/sec] received
				14,842.59 kb/s sent
				29,685.18 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.245327 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,549.83 [#/sec] (mean)
Time per request:		13.245 [ms] (mean)
Time per request:		0.132 [ms] (mean, across all concurrent requests)
Transfer rate:			14,737.27 [Kbytes/sec] received
				14,737.27 kb/s sent
				29,474.55 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.327305 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,503.39 [#/sec] (mean)
Time per request:		13.327 [ms] (mean)
Time per request:		0.133 [ms] (mean, across all concurrent requests)
Transfer rate:			14,646.62 [Kbytes/sec] received
				14,646.62 kb/s sent
				29,293.24 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.408686 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,457.85 [#/sec] (mean)
Time per request:		13.409 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			14,557.73 [Kbytes/sec] received
				14,557.73 kb/s sent
				29,115.45 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.407905 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,458.29 [#/sec] (mean)
Time per request:		13.408 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			14,558.58 [Kbytes/sec] received
				14,558.58 kb/s sent
				29,117.15 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.463582 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,427.44 [#/sec] (mean)
Time per request:		13.464 [ms] (mean)
Time per request:		0.135 [ms] (mean, across all concurrent requests)
Transfer rate:			14,498.37 [Kbytes/sec] received
				14,498.37 kb/s sent
				28,996.74 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.637853 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,332.53 [#/sec] (mean)
Time per request:		13.638 [ms] (mean)
Time per request:		0.136 [ms] (mean, across all concurrent requests)
Transfer rate:			14,313.10 [Kbytes/sec] received
				14,313.10 kb/s sent
				28,626.21 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.780887 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,256.43 [#/sec] (mean)
Time per request:		13.781 [ms] (mean)
Time per request:		0.138 [ms] (mean, across all concurrent requests)
Transfer rate:			14,164.55 [Kbytes/sec] received
				14,164.55 kb/s sent
				28,329.09 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.448406 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,435.83 [#/sec] (mean)
Time per request:		13.448 [ms] (mean)
Time per request:		0.134 [ms] (mean, across all concurrent requests)
Transfer rate:			14,514.73 [Kbytes/sec] received
				14,514.73 kb/s sent
				29,029.46 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/HBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		13.645347 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		7,328.51 [#/sec] (mean)
Time per request:		13.645 [ms] (mean)
Time per request:		0.136 [ms] (mean, across all concurrent requests)
Transfer rate:			14,305.24 [Kbytes/sec] received
				14,305.24 kb/s sent
				28,610.48 kb/s total
=== Completed ===
===== CBR Proxy =====
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.994487 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,557.26 [#/sec] (mean)
Time per request:		17.994 [ms] (mean)
Time per request:		0.180 [ms] (mean, across all concurrent requests)
Transfer rate:			10,847.77 [Kbytes/sec] received
				10,847.77 kb/s sent
				21,695.53 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.670895 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,659.02 [#/sec] (mean)
Time per request:		17.671 [ms] (mean)
Time per request:		0.177 [ms] (mean, across all concurrent requests)
Transfer rate:			11,046.41 [Kbytes/sec] received
				11,046.41 kb/s sent
				22,092.83 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.674526 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,657.86 [#/sec] (mean)
Time per request:		17.675 [ms] (mean)
Time per request:		0.177 [ms] (mean, across all concurrent requests)
Transfer rate:			11,044.14 [Kbytes/sec] received
				11,044.14 kb/s sent
				22,088.29 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.830257 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,608.44 [#/sec] (mean)
Time per request:		17.830 [ms] (mean)
Time per request:		0.178 [ms] (mean, across all concurrent requests)
Transfer rate:			10,947.68 [Kbytes/sec] received
				10,947.68 kb/s sent
				21,895.37 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.587326 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,685.91 [#/sec] (mean)
Time per request:		17.587 [ms] (mean)
Time per request:		0.176 [ms] (mean, across all concurrent requests)
Transfer rate:			11,098.90 [Kbytes/sec] received
				11,098.90 kb/s sent
				22,197.80 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.522554 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,706.93 [#/sec] (mean)
Time per request:		17.523 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			11,139.93 [Kbytes/sec] received
				11,139.93 kb/s sent
				22,279.86 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.484095 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,719.48 [#/sec] (mean)
Time per request:		17.484 [ms] (mean)
Time per request:		0.175 [ms] (mean, across all concurrent requests)
Transfer rate:			11,164.43 [Kbytes/sec] received
				11,164.43 kb/s sent
				22,328.86 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		18.003446 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,554.49 [#/sec] (mean)
Time per request:		18.003 [ms] (mean)
Time per request:		0.180 [ms] (mean, across all concurrent requests)
Transfer rate:			10,842.37 [Kbytes/sec] received
				10,842.37 kb/s sent
				21,684.74 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.757672 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,631.37 [#/sec] (mean)
Time per request:		17.758 [ms] (mean)
Time per request:		0.178 [ms] (mean, across all concurrent requests)
Transfer rate:			10,992.43 [Kbytes/sec] received
				10,992.43 kb/s sent
				21,984.86 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/CBRProxy
Document Length:		1952 bytes

Concurrency Level:		100
Time taken for tests:		17.981196 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		390400000 bytes
Requests per second:		5,561.37 [#/sec] (mean)
Time per request:		17.981 [ms] (mean)
Time per request:		0.180 [ms] (mean, across all concurrent requests)
Transfer rate:			10,855.79 [Kbytes/sec] received
				10,855.79 kb/s sent
				21,711.57 kb/s total
=== Completed ===
===== Transform Proxy =====
Running iteration 0

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.912243 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,287.58 [#/sec] (mean)
Time per request:		18.912 [ms] (mean)
Time per request:		0.189 [ms] (mean, across all concurrent requests)
Transfer rate:			6,657.06 [Kbytes/sec] received
				10,321.36 kb/s sent
				16,978.42 kb/s total
Running iteration 1

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		19.651950 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,088.55 [#/sec] (mean)
Time per request:		19.652 [ms] (mean)
Time per request:		0.197 [ms] (mean, across all concurrent requests)
Transfer rate:			6,406.49 [Kbytes/sec] received
				9,932.86 kb/s sent
				16,339.35 kb/s total
Running iteration 2

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.712070 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,344.14 [#/sec] (mean)
Time per request:		18.712 [ms] (mean)
Time per request:		0.187 [ms] (mean, across all concurrent requests)
Transfer rate:			6,728.28 [Kbytes/sec] received
				10,431.77 kb/s sent
				17,160.05 kb/s total
Running iteration 3

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.831876 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,310.15 [#/sec] (mean)
Time per request:		18.832 [ms] (mean)
Time per request:		0.188 [ms] (mean, across all concurrent requests)
Transfer rate:			6,685.47 [Kbytes/sec] received
				10,365.40 kb/s sent
				17,050.88 kb/s total
Running iteration 4

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		19.128728 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,227.74 [#/sec] (mean)
Time per request:		19.129 [ms] (mean)
Time per request:		0.191 [ms] (mean, across all concurrent requests)
Transfer rate:			6,581.72 [Kbytes/sec] received
				10,204.55 kb/s sent
				16,786.27 kb/s total
Running iteration 5

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		19.424248 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,148.20 [#/sec] (mean)
Time per request:		19.424 [ms] (mean)
Time per request:		0.194 [ms] (mean, across all concurrent requests)
Transfer rate:			6,481.59 [Kbytes/sec] received
				10,049.29 kb/s sent
				16,530.88 kb/s total
Running iteration 6

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.869873 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,299.45 [#/sec] (mean)
Time per request:		18.870 [ms] (mean)
Time per request:		0.189 [ms] (mean, across all concurrent requests)
Transfer rate:			6,672.01 [Kbytes/sec] received
				10,344.53 kb/s sent
				17,016.54 kb/s total
Running iteration 7

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.818670 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,313.87 [#/sec] (mean)
Time per request:		18.819 [ms] (mean)
Time per request:		0.188 [ms] (mean, across all concurrent requests)
Transfer rate:			6,690.16 [Kbytes/sec] received
				10,372.68 kb/s sent
				17,062.84 kb/s total
Running iteration 8

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		18.948607 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,277.43 [#/sec] (mean)
Time per request:		18.949 [ms] (mean)
Time per request:		0.189 [ms] (mean, across all concurrent requests)
Transfer rate:			6,644.29 [Kbytes/sec] received
				10,301.55 kb/s sent
				16,945.84 kb/s total
Running iteration 9

Server Software:		WSO2-PassThrough-HTTP
Server Hostname:		localhost
Server Port:			8280

Document Path:			http://localhost:8280/services/TransformProxy
Document Length:		1259 bytes

Concurrency Level:		100
Time taken for tests:		19.123134 seconds
Complete requests:		100000
Failed requests:		0
Write errors:			0
Kept alive:			100000
Total transferred:		321100000 bytes
Requests per second:		5,229.27 [#/sec] (mean)
Time per request:		19.123 [ms] (mean)
Time per request:		0.191 [ms] (mean, across all concurrent requests)
Transfer rate:			6,583.65 [Kbytes/sec] received
				10,207.53 kb/s sent
				16,791.18 kb/s total
=== Completed ===